## JSON

no importa el origen de los datos si la informacion esta en formato json

In [12]:
cars=[
    {'name':'honda','price':10000,'model':2020,'power':1300},
    {'name':'toyota','price':12000,'model':2021,'power':1500},
    {'name':'audi','price':15000,'model':2022,'power':1700},
    {'name':'ford','price':17000,'model':2020,'power':1700},
    {'name':'ford','price':18000,'model':2021,'power':1800},
    {'name':'ford','price':19000,'model':2021,'power':1900},
]

In [13]:
"""Generar o volver a escribir la lista en formato json"""

import json

with open('cars.json','w') as f:
    
    json.dump(cars,f,indent=4)

In [14]:
import pandas as pd

df_autos=pd.read_json('cars.json')
df_autos

     name  price  model  power
0   honda  10000   2020   1300
1  toyota  12000   2021   1500
2    audi  15000   2022   1700
3    ford  17000   2020   1700
4    ford  18000   2021   1800
5    ford  19000   2021   1900

In [15]:
gama_alta=df_autos[df_autos['power']>1300]
gama_alta

     name  price  model  power
1  toyota  12000   2021   1500
2    audi  15000   2022   1700
3    ford  17000   2020   1700
4    ford  18000   2021   1800
5    ford  19000   2021   1900

### DOBLE CONDICIONAL

cada condicional va dentro de parentesis

In [16]:
gama_alta_precios=df_autos[(df_autos['power']>1300) & (df_autos['price']>12000)]
gama_alta_precios

   name  price  model  power
2  audi  15000   2022   1700
3  ford  17000   2020   1700
4  ford  18000   2021   1800
5  ford  19000   2021   1900

In [19]:
"""Agrupar por marca de carro y obtener el precio promedio"""

prom_marca=df_autos.groupby('name')['price'].mean()
prom_marca

name
audi      15000.0
ford      18000.0
honda     10000.0
toyota    12000.0
Name: price, dtype: float64